Autodesk.Revit.DB.Lighting.LightFamily.GetLightFamily(Autodesk.Revit.DB.Document)
Creates a light family object from the given family document
document:
The family document
Returns:
The newly created LightFamily object
Throws Autodesk.Revit.Exceptions.ArgumentException:
The Document is the argument that is being validated
The document is not valid because it is not a light family document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013